tsung/http.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

<clients>
    <client host="localhost" weight="1" cpu="10" maxusers="40000">
    </client>
  </clients>

  <servers>
    <server host="example.com" port="443" type="tcp"/>
  </servers>

  <load>
   <arrivalphase phase="1" duration="10" unit="minute">
   <users maxnumber="15000" arrivalrate="8" unit="second"/>
  </arrivalphase>

   <arrivalphase phase="2" duration="10" unit="minute">
   <users maxnumber="15000" arrivalrate="8" unit="second"/>
  </arrivalphase>

   <arrivalphase phase="3" duration="30" unit="minute">
   <users maxnumber="20000" arrivalrate="3" unit="second"/>
  </arrivalphase>

 </load>

 <sessions>
   <session probability="100" name="ab" type="ts_http">
       <for from="1" to="10000000" var="i">
            <request> <http url="example.com/foo/bar" method="GET" version="1.1"/> </request>
      </for>
  </session>
 </sessions>
</tsung>